app/Models/Usuarios.php

SELECT *
FROM `t_usuarios`
WHERE `usuario` = 'admin'
---
	public function obtenerUsuario($data){
        $Usuario = $this->db->table('t_usuarios');
        $Usuario->where($data);
        return $Usuario->get()->getResultArray();